InformationRegisters/стомВариантыЗубов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>стомВариантыЗубов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидРедактирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.стомВидыРедактированияЭлементовКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Конструкция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомКонструкцииЗубовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>удалитьИдентификаторКонструкции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>удалитьВариантЗуба</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомВариантыЗубов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗубнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомВидыЗубныхКарт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗубВКарте</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомЗубыКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантЗуба</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомВариантыЗубов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Область</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>удалитьЗубИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/стомСостоянияЗубов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>стомСостоянияЗубов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидРедактирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.стомВидыРедактированияЭлементовКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗубнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомВидыЗубныхКарт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗубВКарте</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомЗубыКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СегментВЗубе</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомСегментыЗубов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СостояниеСегмента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомСостоянияЗубов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗубИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СегментИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/стомОбозначенияЗубов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>стомОбозначенияЗубов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбозначениеЗуба</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВариантКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомВариантыЗубныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗубнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомВидыЗубныхКарт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗубВКарте</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомЗубыКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/стомЗначенияПараметровЗубнойФормулы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>стомЗначенияПараметровЗубнойФормулы</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.стомПараметрыЗубнойФормулы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗубнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомВидыЗубныхКарт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗубВКарте</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомЗубыКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СегментВЗубе</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомСегментыЗубов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.стомПараметрыЗубнойФормулы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/стомВидыРедактированияЭлементовКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>стомВидыРедактированияЭлементовКарты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Добавление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удаление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/стомВидыОбластей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>стомВидыОбластей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбластьЗуба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конструкция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлементКонструкции</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/стомОбластиСегментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>стомОбластиСегментов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Декоративная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбласти</Name>
					<Type>
						<v8:Type>cfg:EnumRef.стомВидыОбластей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкцияРодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоКонструкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерединаКонструкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецКонструкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокСостояний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомСостоянияЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.стомПараметрыЗубнойФормулы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/стомКонструкцииЗубовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>стомКонструкцииЗубовКлиентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Клиенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗубнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомВидыЗубныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкцияОбласть</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предварительная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУдаления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставЗубовСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставЗубов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗубВКарте</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомЗубыКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/стомСтоматология/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура УстановкаПараметровСеанса(УчетнаяПолитика = Неопределено) Экспорт
	
	стомЗубнаяКартаИнициализация.УстановкаПараметровСеанса();
		
КонецПроцедуры

Функция ЕстьПравоРедактированияЗубнойКарты() Экспорт 
	
	Возврат ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.стомВариантыЗубов) И 
			ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.стомСостоянияЗубов);
	
КонецФункции

Функция СформироватьЗапросАктуальныхВариантовСостояний(ЗубнаяКарта, Клиент, Дата = Неопределено, ВариантКарты = Неопределено, Документ = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда 
		Дата = ТекущаяДата();
	КонецЕсли;
	
	Если ВариантКарты = Неопределено Тогда 
		ВариантКарты = стомСтоматология.ПолучитьВариантКарты();
	КонецЕсли;
	
	Если Документ = Неопределено Тогда 
		Документ = Документы.Прием.ПустаяСсылка();
	КонецЕсли;
	
	ИмяТаблицыДокумента = Документ.Метаданные().ПолноеИмя();
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДокументстомУстановленныеВарианты.ЗубВКарте КАК ЗубВКарте,
	|	ДокументстомУстановленныеВарианты.ВариантЗуба КАК ВариантЗуба,
	|	ДокументстомУстановленныеВарианты.Область КАК Область,
	|	ДокументстомУстановленныеВарианты.ВидРедактирования КАК ВидРедактирования,
	|	0 КАК Приоритет,
	|	ДокументстомУстановленныеВарианты.Конструкция КАК Конструкция
	|ПОМЕСТИТЬ ВсеВариантыФакт
	|ИЗ
	|	Документ.Прием.стомУстановленныеВарианты КАК ДокументстомУстановленныеВарианты
	|ГДЕ
	|	ДокументстомУстановленныеВарианты.Ссылка = &Документ
	|	И ДокументстомУстановленныеВарианты.Ссылка.ЗубнаяКарта = &ЗубнаяКарта
	|	И ДокументстомУстановленныеВарианты.Ссылка.Клиент = &Клиент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	стомВариантыЗубовСрезПоследних.ЗубВКарте,
	|	стомВариантыЗубовСрезПоследних.ВариантЗуба,
	|	стомВариантыЗубовСрезПоследних.Область,
	|	стомВариантыЗубовСрезПоследних.ВидРедактирования,
	|	1,
	|	стомВариантыЗубовСрезПоследних.Конструкция
	|ИЗ
	|	РегистрСведений.стомВариантыЗубов.СрезПоследних(
	|			&Дата,
	|			Клиент = &Клиент
	|				И ЗубнаяКарта = &ЗубнаяКарта) КАК стомВариантыЗубовСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	стомВидыЗубныхКартНастройкаВариантовОбластей.ЗубВКарте,
	|	стомВидыЗубныхКартНастройкаВариантовОбластей.ВариантЗуба,
	|	ВЫБОР
	|		КОГДА стомВидыЗубныхКартНастройкаВариантовОбластей.ВариантЗуба.Основной
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.стомОбластиСегментов.ПустаяСсылка)
	|		ИНАЧЕ стомВидыЗубныхКартНастройкаВариантовОбластей.Область
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.стомВидыРедактированияЭлементовКарты.Добавление),
	|	2,
	|	ЗНАЧЕНИЕ(Справочник.стомКонструкцииЗубовКлиентов.)
	|ИЗ
	|	Справочник.стомВидыЗубныхКарт.НастройкаВариантовОбластей КАК стомВидыЗубныхКартНастройкаВариантовОбластей
	|ГДЕ
	|	стомВидыЗубныхКартНастройкаВариантовОбластей.Ссылка = &ЗубнаяКарта
	|	И стомВидыЗубныхКартНастройкаВариантовОбластей.ВариантКарты = &ВариантКарты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументстомУстановленныеСостояния.ЗубВКарте КАК ЗубВКарте,
	|	ДокументстомУстановленныеСостояния.СегментВЗубе КАК СегментВЗубе,
	|	ДокументстомУстановленныеСостояния.СостояниеСегмента КАК СостояниеСегмента,
	|	ДокументстомУстановленныеСостояния.ВидРедактирования КАК ВидРедактирования,
	|	0 КАК Приоритет
	|ПОМЕСТИТЬ ВсеСостоянияФакт
	|ИЗ
	|	Документ.Прием.стомУстановленныеСостояния КАК ДокументстомУстановленныеСостояния
	|ГДЕ
	|	ДокументстомУстановленныеСостояния.Ссылка = &Документ
	|	И ДокументстомУстановленныеСостояния.Ссылка.ЗубнаяКарта = &ЗубнаяКарта
	|	И ДокументстомУстановленныеСостояния.Ссылка.Клиент = &Клиент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	стомСостоянияЗубовСрезПоследних.ЗубВКарте,
	|	стомСостоянияЗубовСрезПоследних.СегментВЗубе,
	|	стомСостоянияЗубовСрезПоследних.СостояниеСегмента,
	|	стомСостоянияЗубовСрезПоследних.ВидРедактирования,
	|	1
	|ИЗ
	|	РегистрСведений.стомСостоянияЗубов.СрезПоследних(
	|			&Дата,
	|			Клиент = &Клиент
	|				И ЗубнаяКарта = &ЗубнаяКарта) КАК стомСостоянияЗубовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеВариантыФакт.ЗубВКарте КАК ЗубВКарте,
	|	ВсеВариантыФакт.ВариантЗуба КАК ВариантЗуба,
	|	ВсеВариантыФакт.Область КАК Область,
	|	ВсеВариантыФакт.Конструкция,
	|	ВсеВариантыФакт.ВариантЗуба.Основной,
	|	ВсеВариантыФакт.Область.ВидОбласти КАК ВидОбласти
	|ПОМЕСТИТЬ АктуальныеВариантыЗубов
	|ИЗ
	|	ВсеВариантыФакт КАК ВсеВариантыФакт
	|ГДЕ
	|	ВсеВариантыФакт.Приоритет В
	|			(ВЫБРАТЬ
	|				МИНИМУМ(МинВсеВарианты.Приоритет)
	|			ИЗ
	|				ВсеВариантыФакт КАК МинВсеВарианты
	|			ГДЕ
	|				МинВсеВарианты.ЗубВКарте = ВсеВариантыФакт.ЗубВКарте
	|				И МинВсеВарианты.ВариантЗуба = ВсеВариантыФакт.ВариантЗуба
	|				И МинВсеВарианты.Область = ВсеВариантыФакт.Область)
	|	И ВсеВариантыФакт.ВидРедактирования = ЗНАЧЕНИЕ(Перечисление.стомВидыРедактированияЭлементовКарты.Добавление)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АктуальныеВариантыЗубов.ЗубВКарте КАК ЗубВКарте,
	|	АктуальныеВариантыЗубов.ВариантЗуба КАК ВариантЗуба,
	|	ВЫБОР
	|		КОГДА АктуальныеВариантыЗубов.ВариантЗубаОсновной
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.стомОбластиСегментов.ПустаяСсылка)
	|		ИНАЧЕ АктуальныеВариантыЗубов.Область
	|	КОНЕЦ КАК Область
	|ИЗ
	|	АктуальныеВариантыЗубов КАК АктуальныеВариантыЗубов
	|ГДЕ
	|	(АктуальныеВариантыЗубов.ВариантЗубаОсновной
	|			ИЛИ АктуальныеВариантыЗубов.ВидОбласти = ЗНАЧЕНИЕ(Перечисление.стомВидыОбластей.ОбластьЗуба))
	|ИТОГИ ПО
	|	ЗубВКарте,
	|	ВариантЗуба,
	|	Область
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АктуальныеВариантыЗубов.ЗубВКарте,
	|	АктуальныеВариантыЗубов.ВариантЗуба КАК ВариантЗуба,
	|	ВЫБОР
	|		КОГДА АктуальныеВариантыЗубов.ВидОбласти = ЗНАЧЕНИЕ(Перечисление.стомВидыОбластей.Конструкция)
	|			ТОГДА АктуальныеВариантыЗубов.Область
	|		ИНАЧЕ АктуальныеВариантыЗубов.Область.КонструкцияРодитель
	|	КОНЕЦ КАК Область,
	|	АктуальныеВариантыЗубов.Конструкция КАК Конструкция
	|ИЗ
	|	АктуальныеВариантыЗубов КАК АктуальныеВариантыЗубов
	|ГДЕ
	|	АктуальныеВариантыЗубов.ВидОбласти В (ЗНАЧЕНИЕ(Перечисление.стомВидыОбластей.Конструкция), ЗНАЧЕНИЕ(Перечисление.стомВидыОбластей.ЭлементКонструкции))
	|ИТОГИ ПО
	|	Конструкция,
	|	ВариантЗуба,
	|	Область
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеСостоянияФакт.ЗубВКарте КАК ЗубВКарте,
	|	ВсеСостоянияФакт.СегментВЗубе КАК СегментВЗубе,
	|	ВсеСостоянияФакт.СостояниеСегмента КАК СостояниеСегмента
	|ИЗ
	|	ВсеСостоянияФакт КАК ВсеСостоянияФакт
	|ГДЕ
	|	ВсеСостоянияФакт.Приоритет В
	|			(ВЫБРАТЬ
	|				МИНИМУМ(МинВсеСостояния.Приоритет)
	|			ИЗ
	|				ВсеСостоянияФакт КАК МинВсеСостояния
	|			ГДЕ
	|				МинВсеСостояния.ЗубВКарте = ВсеСостоянияФакт.ЗубВКарте
	|				И МинВсеСостояния.СегментВЗубе = ВсеСостоянияФакт.СегментВЗубе
	|				И МинВсеСостояния.СостояниеСегмента = ВсеСостоянияФакт.СостояниеСегмента)
	|	И ВсеСостоянияФакт.ВидРедактирования = ЗНАЧЕНИЕ(Перечисление.стомВидыРедактированияЭлементовКарты.Добавление)
	|ИТОГИ ПО
	|	ЗубВКарте,
	|	СостояниеСегмента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	стомОбозначенияЗубовСрезПоследних.ЗубВКарте,
	|	стомОбозначенияЗубовСрезПоследних.ОбозначениеЗуба
	|ИЗ
	|	РегистрСведений.стомОбозначенияЗубов.СрезПоследних(
	|			&Дата,
	|			Клиент = &Клиент
	|				И ЗубнаяКарта = &ЗубнаяКарта) КАК стомОбозначенияЗубовСрезПоследних";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.Прием", ИмяТаблицыДокумента);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ЗубнаяКарта", ЗубнаяКарта);
	Запрос.УстановитьПараметр("ВариантКарты", ВариантКарты);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Возврат Запрос;
	
КонецФункции

Функция ПолучитьЗубнуюКарту() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	стомВидыЗубныхКарт.Ссылка
	|ИЗ
	|	Справочник.стомВидыЗубныхКарт КАК стомВидыЗубныхКарт
	|
	|УПОРЯДОЧИТЬ ПО
	|	стомВидыЗубныхКарт.ПометкаУдаления";
	ВыборкаЗК = Запрос.Выполнить().Выбрать();
	Если ВыборкаЗК.Следующий() Тогда
		Возврат ВыборкаЗК.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьВариантКарты(Клиент = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Клиент) И Не ВедетсяНесколькоЗубныхКарт() Тогда
		Если ОбщегоНазначенияКлиентСервер.ПолучитьПолноеЧислоЛетСДаты(Клиент.ДатаРождения, ТекущаяДата()) <= 14 Тогда
			// Создается при первом запуске базы, непредопределенный элемент справочника.
			РезультатПоиска = Справочники.стомВариантыЗубныхКарт.НайтиПоНаименованию("Детская");
			Если ЗначениеЗаполнено(РезультатПоиска) Тогда
				Возврат РезультатПоиска;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	стомВариантыЗубныхКарт.Ссылка
	|ИЗ
	|	Справочник.стомВариантыЗубныхКарт КАК стомВариантыЗубныхКарт
	|
	|УПОРЯДОЧИТЬ ПО
	|	стомВариантыЗубныхКарт.ПометкаУдаления";	
	ВыборкаВК = Запрос.Выполнить().Выбрать();
	Если ВыборкаВК.Следующий() Тогда
		Возврат ВыборкаВК.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьКонструкцииЗубыРедактированныеВПриеме(Прием, Клиент = Неопределено, ЗубнаяКарта = Неопределено) Экспорт 
	
	Если Клиент = Неопределено Тогда 
		Клиент = Прием.Клиент;
	КонецЕсли;
	
	Если ЗубнаяКарта = Неопределено Тогда 
		ЗубнаяКарта = Прием.ЗубнаяКарта;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА стомВариантыЗубов.Конструкция = ЗНАЧЕНИЕ(Справочник.стомКонструкцииЗубовКлиентов.ПустаяСсылка)
	|			ТОГДА стомВариантыЗубов.ЗубВКарте
	|		ИНАЧЕ стомВариантыЗубов.Конструкция
	|	КОНЕЦ КАК КонструкцияЗуб,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА стомВариантыЗубов.Конструкция <> ЗНАЧЕНИЕ(Справочник.стомКонструкцииЗубовКлиентов.ПустаяСсылка)
	|				ТОГДА 0
	|			КОГДА НЕ стомВариантыЗубов.ВариантЗуба.Основной
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ) КАК Приоритет
	|ИЗ
	|	РегистрСведений.стомВариантыЗубов КАК стомВариантыЗубов
	|ГДЕ
	|	стомВариантыЗубов.Регистратор = &Прием
	|	И стомВариантыЗубов.ЗубнаяКарта = &ЗубнаяКарта
	|	И стомВариантыЗубов.Клиент = &Клиент
	|	И стомВариантыЗубов.ВидРедактирования = ЗНАЧЕНИЕ(Перечисление.стомВидыРедактированияЭлементовКарты.Добавление)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА стомВариантыЗубов.Конструкция = ЗНАЧЕНИЕ(Справочник.стомКонструкцииЗубовКлиентов.ПустаяСсылка)
	|			ТОГДА стомВариантыЗубов.ЗубВКарте
	|		ИНАЧЕ стомВариантыЗубов.Конструкция
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	Запрос.УстановитьПараметр("Прием", Прием);
	Запрос.УстановитьПараметр("ЗубнаяКарта", ЗубнаяКарта);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КонструкцияЗуб");
	
КонецФункции

Функция ПолучитьОбозначенияЗубовНаДату(Клиент, ЗубнаяКарта, Дата = Неопределено) Экспорт 
	
	Если Дата = Неопределено Тогда 
		Дата = Дата(1,1,1);
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	стомОбозначенияЗубовСрезПоследних.ЗубВКарте,
	|	стомОбозначенияЗубовСрезПоследних.ОбозначениеЗуба
	|ИЗ
	|	РегистрСведений.стомОбозначенияЗубов.СрезПоследних(
	|			&Дата,
	|			Клиент = &Клиент
	|				И ЗубнаяКарта = &ЗубнаяКарта) КАК стомОбозначенияЗубовСрезПоследних";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ЗубнаяКарта", ЗубнаяКарта);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Результат = Запрос.Выполнить();	
	Выборка = Результат.Выбрать();
	
	ОбозначенияЗубов = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		ОбозначенияЗубов[Выборка.ЗубВКарте] = Выборка.ОбозначениеЗуба;
	КонецЦикла;
	
	Возврат ОбозначенияЗубов;
	
КонецФункции

Процедура УстановитьУсловноеОформлениеЗубов(Форма, НазванияПолейОформления, ОбозначенияЗубов = Неопределено) Экспорт
	
	мсЭлементыНаУдаление = Новый Массив;
	Для Каждого ЭлементОформления Из Форма.УсловноеОформление.Элементы Цикл
		Если ЭлементОформления.ИдентификаторПользовательскойНастройки = "ОбозначенияЗубов" Тогда
			мсЭлементыНаУдаление.Добавить(ЭлементОформления);
		КонецЕсли;
	КонецЦикла;
	Для Каждого элНаУдаление Из мсЭлементыНаУдаление Цикл
		Форма.УсловноеОформление.Элементы.Удалить(элНаУдаление);
	КонецЦикла;

	Если ОбозначенияЗубов <> Неопределено Тогда 
	
		Для Каждого ИмяПоля Из НазванияПолейОформления Цикл
			Для Каждого Зуб Из ОбозначенияЗубов Цикл
				ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
				ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "ОбозначенияЗубов";
				ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
				ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
				ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Форма.Элементы[ИмяПоля].ПутьКДанным);
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.ПравоеЗначение = Зуб.Значение;
				ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", Зуб.Представление);	
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьДиапазонЗубовЧелюсти() Экспорт 
	
	мсСписокЗубов = Новый Массив;
	мсСписокЗубов.Добавить("18");
	мсСписокЗубов.Добавить("17");
	мсСписокЗубов.Добавить("16");
	мсСписокЗубов.Добавить("15");
	мсСписокЗубов.Добавить("14");
	мсСписокЗубов.Добавить("13");
	мсСписокЗубов.Добавить("12");
	мсСписокЗубов.Добавить("11");
	мсСписокЗубов.Добавить("21");
	мсСписокЗубов.Добавить("22");
	мсСписокЗубов.Добавить("23");
	мсСписокЗубов.Добавить("24");
	мсСписокЗубов.Добавить("25");
	мсСписокЗубов.Добавить("26");
	мсСписокЗубов.Добавить("27");
	мсСписокЗубов.Добавить("28");
	мсСписокЗубов.Добавить("48");
	мсСписокЗубов.Добавить("47");
	мсСписокЗубов.Добавить("46");
	мсСписокЗубов.Добавить("45");
	мсСписокЗубов.Добавить("44");
	мсСписокЗубов.Добавить("43");
	мсСписокЗубов.Добавить("42");
	мсСписокЗубов.Добавить("41");
	мсСписокЗубов.Добавить("31");
	мсСписокЗубов.Добавить("32");
	мсСписокЗубов.Добавить("33");
	мсСписокЗубов.Добавить("34");
	мсСписокЗубов.Добавить("35");
	мсСписокЗубов.Добавить("36");
	мсСписокЗубов.Добавить("37");
	мсСписокЗубов.Добавить("38");
	
	Возврат мсСписокЗубов;
	
КонецФункции

Функция ПолучитьТаблицуПорядкаЗубов() Экспорт 
	
	ТаблицаПорядок = Новый ТаблицаЗначений;
	ТаблицаПорядок.Колонки.Добавить("НаименованиеЗуба", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(10)));
	ТаблицаПорядок.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	ДиапазонЗубов = стомСтоматология.ПолучитьДиапазонЗубовЧелюсти();
	ТаблицаПорядок.ЗагрузитьКолонку(ДиапазонЗубов, "НаименованиеЗуба");
	Для Сч = 0 По ДиапазонЗубов.Количество() - 1 Цикл
		НоваяСтрока = ТаблицаПорядок.Добавить();
		НоваяСтрока.НаименованиеЗуба = ДиапазонЗубов[Сч];
		НоваяСтрока.Порядок = Сч;
	КонецЦикла;
	
	Возврат ТаблицаПорядок;
	
КонецФункции

Функция ПолучитьЗубыВДиапазоне(Знач НачальныйЗуб, Знач КонечныйЗуб, ДиапазонЗубов = Неопределено) Экспорт
	
	НачальныйЗуб = Строка(НачальныйЗуб);
	КонечныйЗуб = Строка(КонечныйЗуб);
	
	Если ДиапазонЗубов = Неопределено Тогда 
		ДиапазонЗубов = ПолучитьДиапазонЗубовЧелюсти();
	КонецЕсли;
	
	мсВозврат = Новый Массив;
	ПервыйИндекс = ДиапазонЗубов.Найти(НачальныйЗуб);
	ВторойИндекс = ДиапазонЗубов.Найти(КонечныйЗуб);
	
	Для Сч = Мин(ПервыйИндекс, ВторойИндекс) По Макс(ПервыйИндекс, ВторойИндекс) Цикл
		мсВозврат.Добавить(ДиапазонЗубов[Сч]);
	КонецЦикла;
	
	Возврат мсВозврат;
	
КонецФункции

Функция СформироватьЗубнуюКартуHTML(Клиент, ЗубнаяКарта, Прием = Неопределено, Дата = Неопределено, 
	ВыводитьСостояния = Истина, ВыводитьВарианты = Истина, ВыводитьКонструкции = Ложь, ВыводитьРасшифровкуОбозначений = Истина, Оформление = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда 
		Дата = Дата(1,1,1);
	КонецЕсли;
	
	// Добавился параметр ВыводитьРасшифровкуОбозначений перед Оформление в 2.0.26.2.
	Если ТипЗнч(ВыводитьРасшифровкуОбозначений) = Тип("Структура") Тогда
		Оформление = ВыводитьРасшифровкуОбозначений;
		ВыводитьРасшифровкуОбозначений = Истина;
	КонецЕсли;
	
	ТаблицаПорядок = Новый ТаблицаЗначений;
	ТаблицаПорядок.Колонки.Добавить("НаименованиеЗуба", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(10)));
	ТаблицаПорядок.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	ТаблицаПорядок.ЗагрузитьКолонку(ПолучитьДиапазонЗубовЧелюсти(), "НаименованиеЗуба");
	ДиапазонЗубов = ПолучитьДиапазонЗубовЧелюсти();
	Для Сч = 0 По ДиапазонЗубов.Количество() - 1 Цикл
		НоваяСтрока = ТаблицаПорядок.Добавить();
		НоваяСтрока.НаименованиеЗуба = ДиапазонЗубов[Сч];
		НоваяСтрока.Порядок = Сч;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ЗубнаяКарта", ЗубнаяКарта);
	Запрос.УстановитьПараметр("БезПриема", Прием = Неопределено);
	Запрос.УстановитьПараметр("Прием", Прием);
	Запрос.УстановитьПараметр("ПорядокЗубов", ТаблицаПорядок);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПорядокЗубов.НаименованиеЗуба,
	|	ПорядокЗубов.Порядок
	|ПОМЕСТИТЬ ПорядокЗубов
	|ИЗ
	|	&ПорядокЗубов КАК ПорядокЗубов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	стомЗубыКарты.Ссылка КАК ЗубВКарте,
	|	ВЫБОР
	|		КОГДА стомЗубыКарты.Наименование ПОДОБНО ""[12]_""
	|			ТОГДА ""Верх""
	|		КОГДА стомЗубыКарты.Наименование ПОДОБНО ""[34]_""
	|			ТОГДА ""Низ""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Расположение,
	|	ПорядокЗубов.Порядок
	|ПОМЕСТИТЬ ВсеЗубыКарты
	|ИЗ
	|	Справочник.стомЗубыКарты КАК стомЗубыКарты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокЗубов КАК ПорядокЗубов
	|		ПО стомЗубыКарты.Наименование = ПорядокЗубов.НаименованиеЗуба
	|ГДЕ
	|	стомЗубыКарты.Владелец = &ЗубнаяКарта
	|	И ВЫБОР
	|			КОГДА стомЗубыКарты.Наименование ПОДОБНО ""[12]_""
	|				ТОГДА ""Верх""
	|			КОГДА стомЗубыКарты.Наименование ПОДОБНО ""[34]_""
	|				ТОГДА ""Низ""
	|			ИНАЧЕ """"
	|		КОНЕЦ <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	стомВариантыЗубовСрезПоследних.Клиент,
	|	стомВариантыЗубовСрезПоследних.ЗубнаяКарта,
	|	ВсеЗубыКарты.ЗубВКарте,
	|	стомВариантыЗубовСрезПоследних.ВариантЗуба,
	|  стомВариантыЗубовСрезПоследних.Область КАК КонструкцияОбласть,
	|	стомВариантыЗубовСрезПоследних.Конструкция,
	|	ВсеЗубыКарты.Расположение КАК Расположение,
	|	ВсеЗубыКарты.Порядок
	|ПОМЕСТИТЬ ВариантыКарты
	|ИЗ
	|	ВсеЗубыКарты КАК ВсеЗубыКарты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.стомВариантыЗубов.СрезПоследних(
	|				&Дата,
	|				ЗубнаяКарта = &ЗубнаяКарта
	|						И Клиент = &Клиент
	|						И &БезПриема
	|					ИЛИ Регистратор = &Прием) КАК стомВариантыЗубовСрезПоследних
	|		ПО ВсеЗубыКарты.ЗубВКарте = стомВариантыЗубовСрезПоследних.ЗубВКарте
	|			И (стомВариантыЗубовСрезПоследних.ВидРедактирования = ЗНАЧЕНИЕ(Перечисление.стомВидыРедактированияЭлементовКарты.Добавление))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеЗубыКарты.ЗубВКарте,
	|	стомОбозначенияЗубовСрезПоследних.ОбозначениеЗуба КАК Обозначение,
	|	ВсеЗубыКарты.Расположение КАК Расположение
	|ИЗ
	|	ВсеЗубыКарты КАК ВсеЗубыКарты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.стомОбозначенияЗубов.СрезПоследних(
	|				&Дата,
	|				ЗубнаяКарта = &ЗубнаяКарта
	|					И Клиент = &Клиент) КАК стомОбозначенияЗубовСрезПоследних
	|		ПО ВсеЗубыКарты.ЗубВКарте = стомОбозначенияЗубовСрезПоследних.ЗубВКарте
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВсеЗубыКарты.Порядок
	|ИТОГИ ПО
	|	Расположение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВариантыКарты.ЗубВКарте КАК ЗубВКарте,
	|	ВариантыКарты.ВариантЗуба,
	|	ВариантыКарты.Расположение КАК Расположение,
	|	ВариантыКарты.ВариантЗуба.Обозначение КАК Обозначение,
	|	ВариантыКарты.ВариантЗуба.Основной КАК Основной,
	|	ВариантыКарты.Порядок
	|ИЗ
	|	ВариантыКарты КАК ВариантыКарты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВариантыКарты.Порядок,
	|	Основной УБЫВ
	|ИТОГИ ПО
	|	Расположение,
	|	ЗубВКарте
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеЗубыКарты.ЗубВКарте КАК ЗубВКарте,
	|	стомСостоянияЗубовСрезПоследних.СостояниеСегмента,
	|	ВсеЗубыКарты.Расположение КАК Расположение,
	|	стомСостоянияЗубовСрезПоследних.СостояниеСегмента.КраткоеОбозначение КАК Обозначение,
	|	ВсеЗубыКарты.Порядок
	|ИЗ
	|	ВсеЗубыКарты КАК ВсеЗубыКарты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.стомСостоянияЗубов.СрезПоследних(
	|				&Дата,
	|				ЗубнаяКарта = &ЗубнаяКарта
	|						И Клиент = &Клиент
	|						И &БезПриема
	|					ИЛИ Регистратор = &Прием) КАК стомСостоянияЗубовСрезПоследних
	|		ПО ВсеЗубыКарты.ЗубВКарте = стомСостоянияЗубовСрезПоследних.ЗубВКарте
	|			И (стомСостоянияЗубовСрезПоследних.ВидРедактирования = ЗНАЧЕНИЕ(Перечисление.стомВидыРедактированияЭлементовКарты.Добавление))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВсеЗубыКарты.Порядок
	|ИТОГИ ПО
	|	Расположение,
	|	ЗубВКарте
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВариантыКарты.КонструкцияОбласть,
	|	ВсеЗубыКарты.ЗубВКарте КАК ЗубВКарте,
	|	ВсеЗубыКарты.Расположение КАК Расположение,
	|	ВариантыКарты.КонструкцияОбласть.Обозначение КАК Обозначение,
	|	ВсеЗубыКарты.Порядок КАК Порядок,
	|	ВариантыКарты.Конструкция КАК Конструкция
	|ИЗ
	|	ВсеЗубыКарты КАК ВсеЗубыКарты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВариантыКарты КАК ВариантыКарты
	|		ПО ВсеЗубыКарты.ЗубВКарте = ВариантыКарты.ЗубВКарте
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|ИТОГИ ПО
	|	Расположение,
	|	ЗубВКарте";
	
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаОбозначения = Результат[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаВарианты = Результат[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаСостояния = Результат[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКонструкции = Результат[6].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
	ПараметрыОформления = стомПараметрыЗубов.ПолучитьОформлениеПоУмолчаниюДляТаблицЗубнойФормулы(Оформление);
	
	ДокументHTML = РаботаСDOMКлиентСервер.СоздатьДокументDOM(СтрШаблон("<DIV>%1</DIV>", ТаблицаЗубнойКартыОбъявлениеHTML()));
	Таблица = РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоИмени(ДокументHTML, "TBODY", Истина)[0];
	КорневойЭлемент = РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоИмени(ДокументHTML, "DIV", Истина)[0];;
	
	ЗаголовокТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "CAPTION", Таблица);
	ТекстЗаголовка = РаботаСDOMКлиентСервер.СоздатьТекстовыйЭлементDOM(ДокументHTML, "Зубная формула", ЗаголовокТаблицы, , ПараметрыОформления.АтрибутыЗаголовкаТаблицы);
	
	СтрокиНаДобавление = Новый Структура("Верх, Низ", Новый Массив, Новый Массив);
	
	СоотвОбозначенияЧелюсти = Новый Соответствие;
	СоотвОбозначенияЧелюсти.Вставить("Верх", "Верхняя");
	СоотвОбозначенияЧелюсти.Вставить("Низ", "Нижняя");
	
	СтруктРасшифровкаОбозначений = Новый Структура("Варианты, Состояния", Новый Соответствие, Новый Соответствие);
	
	// Выводим обозначения
	Пока ВыборкаОбозначения.Следующий() Цикл
		
		СтрокаТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TR", , , ПараметрыОформления.АтрибутыСтрокОбозначения);
		СтрокиНаДобавление[ВыборкаОбозначения.Расположение].Добавить(СтрокаТаблицы);
		
		// Колонка обозначения челюсти
		КолонкаТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TD", СтрокаТаблицы, , ПараметрыОформления.АтрибутыКолонкиПараметров);
		ТекстКолонки = РаботаСDOMКлиентСервер.СоздатьТекстовыйЭлементDOM(ДокументHTML, СоотвОбозначенияЧелюсти[ВыборкаОбозначения.Расположение], КолонкаТаблицы);
		
		ВыборкаЗуб = ВыборкаОбозначения.Выбрать();
		Пока ВыборкаЗуб.Следующий() Цикл
			
			КолонкаТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TD", СтрокаТаблицы);
			ТекстКолонки = РаботаСDOMКлиентСервер.СоздатьТекстовыйЭлементDOM(ДокументHTML, ВыборкаЗуб.Обозначение, КолонкаТаблицы);
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Добавляем варианты
	Если ВыводитьВарианты Тогда 
		Пока ВыборкаВарианты.Следующий() Цикл
			
			СтрокаТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TR", , , ПараметрыОформления.АтрибутыСтрокСостоянийЗубов);
			СтрокиНаДобавление[ВыборкаВарианты.Расположение].Добавить(СтрокаТаблицы);
			
			КолонкаТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TD", СтрокаТаблицы, , ПараметрыОформления.АтрибутыКолонкиПараметров);
			ТекстКолонки = РаботаСDOMКлиентСервер.СоздатьТекстовыйЭлементDOM(ДокументHTML, "Варианты", КолонкаТаблицы);
			
			ВыборкаЗуб = ВыборкаВарианты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЗуб.Следующий() Цикл
				
				СтрокаОсновнойВариант = "";
				СтрокаВарианты = "";
				ВыборкаСоставВариантов = ВыборкаЗуб.Выбрать();
				Пока ВыборкаСоставВариантов.Следующий() Цикл
					Если Не ЗначениеЗаполнено(ВыборкаСоставВариантов.ВариантЗуба) Тогда 
						Прервать;
					КонецЕсли;
					Если Не ПустаяСтрока(ВыборкаСоставВариантов.Обозначение) Тогда
						СтруктРасшифровкаОбозначений.Варианты.Вставить(ВыборкаСоставВариантов.ВариантЗуба, ВыборкаСоставВариантов.Обозначение);
						Если ВыборкаСоставВариантов.Основной Тогда 
							СтрокаОсновнойВариант = ВыборкаСоставВариантов.Обозначение;
						Иначе
							Если Не ПустаяСтрока(ВыборкаСоставВариантов.Обозначение) Тогда 
								ОбщегоНазначенияБИТКлиентСервер.КонкатенацияСтрок(СтрокаВарианты, ВыборкаСоставВариантов.Обозначение, "; ");
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				КолонкаТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TD", СтрокаТаблицы);
				
				Если Не ПустаяСтрока(СтрокаОсновнойВариант) Тогда
					
					СтрокаОсновнойВариант = "[" + СтрокаОсновнойВариант + "]" + ?(ПустаяСтрока(СтрокаВарианты), "", " ");
					ТекстКолонки = РаботаСDOMКлиентСервер.СоздатьТекстовыйЭлементDOM(ДокументHTML, СтрокаОсновнойВариант, КолонкаТаблицы, , ПараметрыОформления.АтрибутыЯчеекОсновныхВариантов);

				КонецЕсли;
				
				СтрокаВарианты = ?(ПустаяСтрока(СтрокаВарианты) И ПустаяСтрока(СтрокаОсновнойВариант), Символы.НПП, СтрокаВарианты);
				ТекстКолонки = РаботаСDOMКлиентСервер.СоздатьТекстовыйЭлементDOM(ДокументHTML, СтрокаВарианты, КолонкаТаблицы);

			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
	// Состояния зубов
	Если ВыводитьСостояния Тогда 
		Пока ВыборкаСостояния.Следующий() Цикл
			
			СтрокаТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TR", , , ПараметрыОформления.АтрибутыСтрокСостоянийЗубов);
			СтрокиНаДобавление[ВыборкаСостояния.Расположение].Добавить(СтрокаТаблицы);
			
			КолонкаТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TD", СтрокаТаблицы, , ПараметрыОформления.АтрибутыКолонкиПараметров);
			ТекстКолонки = РаботаСDOMКлиентСервер.СоздатьТекстовыйЭлементDOM(ДокументHTML, "Состояния", КолонкаТаблицы);
			
			ВыборкаЗуб = ВыборкаСостояния.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЗуб.Следующий() Цикл
				
				СтрокаСостояния = "";
				ВыборкаСоставСостояний = ВыборкаЗуб.Выбрать();
				Пока ВыборкаСоставСостояний.Следующий() Цикл
					Если Не ЗначениеЗаполнено(ВыборкаСоставСостояний.СостояниеСегмента) Тогда 
						Прервать;
					КонецЕсли;
					Если Не ПустаяСтрока(ВыборкаСоставСостояний.Обозначение) Тогда
						СтруктРасшифровкаОбозначений.Состояния.Вставить(ВыборкаСоставСостояний.СостояниеСегмента, ВыборкаСоставСостояний.Обозначение);
						ОбщегоНазначенияБИТКлиентСервер.КонкатенацияСтрок(СтрокаСостояния, ВыборкаСоставСостояний.Обозначение, "; ");
					КонецЕсли;
				КонецЦикла;
				
				СтрокаСостояния = ?(ПустаяСтрока(СтрокаСостояния), Символы.НПП, СтрокаСостояния);
				КолонкаТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TD", СтрокаТаблицы);
				ТекстКолонки = РаботаСDOMКлиентСервер.СоздатьТекстовыйЭлементDOM(ДокументHTML, СтрокаСостояния, КолонкаТаблицы);
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
	// Конструкции
	соотвУстановленныеКонструкции = Новый Соответствие;
	Если ВыводитьКонструкции Тогда
		
		Пока ВыборкаКонструкции.Следующий() Цикл
			
			СтрокаТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TR", , , ПараметрыОформления.АтрибутыСтрокСостоянийЗубов);
			СтрокиНаДобавление[ВыборкаКонструкции.Расположение].Добавить(СтрокаТаблицы);
			
			КолонкаТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TD", СтрокаТаблицы, , ПараметрыОформления.АтрибутыКолонкиПараметров);
			ТекстКолонки = РаботаСDOMКлиентСервер.СоздатьТекстовыйЭлементDOM(ДокументHTML, "Конструкции", КолонкаТаблицы);
			
			ВыборкаЗуб = ВыборкаКонструкции.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЗуб.Следующий() Цикл
				
				ВыборкаСоставКонструкции = ВыборкаЗуб.Выбрать();
				Если Не ВыборкаСоставКонструкции.Следующий() Или 
					Не ЗначениеЗаполнено(ВыборкаСоставКонструкции.Конструкция) 
				Тогда
					КолонкаТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TD", СтрокаТаблицы);
					Продолжить;
				КонецЕсли;
				
				ЭлементКонструкции = соотвУстановленныеКонструкции.Получить(ВыборкаСоставКонструкции.Конструкция);
				Если ЭлементКонструкции = Неопределено Тогда 
					
					ОбозначениеКонструкции = ?(ПустаяСтрока(ВыборкаСоставКонструкции.Обозначение), Символы.НПП, ВыборкаСоставКонструкции.Обозначение);
					КолонкаТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TD", СтрокаТаблицы);
					ТекстКолонки = РаботаСDOMКлиентСервер.СоздатьТекстовыйЭлементDOM(ДокументHTML, ОбозначениеКонструкции, КолонкаТаблицы);
					
					СтруктураКонструкции = Новый Структура("Элемент, КоличествоЗубов", КолонкаТаблицы, 1);
					соотвУстановленныеКонструкции.Вставить(ВыборкаСоставКонструкции.Конструкция, СтруктураКонструкции);
					
				Иначе // Конструкцию уже добавляли, расширяем
					
					ЭлементКонструкции.КоличествоЗубов = ЭлементКонструкции.КоличествоЗубов + 1;
					РаботаСDOMКлиентСервер.УстановитьАтрибутЭлементуDOM(ЭлементКонструкции.Элемент, "colspan", Формат(ЭлементКонструкции.КоличествоЗубов, "ЧГ=0"));  
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Добавляем строки верхней челюсти в обратном порядке
	Сч = СтрокиНаДобавление.Верх.Количество() - 1;
	Пока Сч >= 0 Цикл	
		Таблица.ДобавитьДочерний(СтрокиНаДобавление.Верх[Сч]);
		Сч = Сч - 1;
	КонецЦикла;
	Для Каждого СтрокаНаДобавление Из СтрокиНаДобавление.Низ Цикл 
		Таблица.ДобавитьДочерний(СтрокаНаДобавление);
	КонецЦикла;
	
	// Выводим расшифровку обозначений состояний и вариантов
	Если ВыводитьРасшифровкуОбозначений Тогда
		Для Каждого кзВидРасшифровки Из СтруктРасшифровкаОбозначений Цикл
			
			Если кзВидРасшифровки.Значение.Количество() = 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			ТекстЗаголовкаРасшифровки = Строка(кзВидРасшифровки.Ключ) + ": ";
			ТекстРасшифровки = "";
			Для Каждого кзСостояниеВариант Из кзВидРасшифровки.Значение Цикл 
				ОбщегоНазначенияБИТКлиентСервер.КонкатенацияСтрок(ТекстРасшифровки, кзСостояниеВариант.Значение + " - " + Строка(кзСостояниеВариант.Ключ), ", ");
			КонецЦикла;
			РаботаСDOMКлиентСервер.СоздатьТекстовыйЭлементDOM(ДокументHTML, ТекстЗаголовкаРасшифровки + ТекстРасшифровки, КорневойЭлемент, , ПараметрыОформления.АтрибутыТекстаРасшифровки);
			
		КонецЦикла;
	КонецЕсли;
	
	Результат = РаботаСDOMКлиентСервер.ПолучитьТекстHTMLДокументаDOM(ДокументHTML);
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаЗубнойКартыОбъявлениеHTML()
	
	Возврат "<TABLE border=1 style='border-color: inherit; border-style: solid; border-collapse: collapse;' width='100%'><TBODY></TBODY></TABLE>";
	
КонецФункции

Функция ВедетсяНесколькоЗубныхКарт() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	стомВидыЗубныхКарт.Ссылка
	|ИЗ
	|	Справочник.стомВидыЗубныхКарт КАК стомВидыЗубныхКарт
	|ГДЕ
	|	НЕ стомВидыЗубныхКарт.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Количество() > 1; 
	
КонецФункции

Функция ПолучитьВидВариантЗубнойКарты(Клиент) Экспорт
	
	КартаВариант = Новый Структура("ЗубнаяКарта, ВариантЗубнойКарты", 
		Справочники.стомВидыЗубныхКарт.ПустаяСсылка(), Справочники.стомВидыЗубныхКарт.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Прием.ВариантЗубнойКарты КАК ВариантЗубнойКарты,
		|	Прием.ЗубнаяКарта КАК ЗубнаяКарта
		|ИЗ
		|	Документ.Прием КАК Прием
		|ГДЕ
		|	Прием.Клиент = &Клиент 
		|	// %ОтборСтоматологическийПрием И Прием.СтоматологическийПрием = ИСТИНА
		|УПОРЯДОЧИТЬ ПО
		|	Прием.Дата УБЫВ";
	
	Если Метаданные.Документы.Прием.Реквизиты.Найти("СтоматологическийПрием") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "// %ОтборСтоматологическийПрием", "");
	КонецЕсли;
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ВариантЗубнойКарты) Тогда
			КартаВариант.ВариантЗубнойКарты = Выборка.ВариантЗубнойКарты;
			КартаВариант.ЗубнаяКарта = Выборка.ЗубнаяКарта;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(КартаВариант.ВариантЗубнойКарты) Тогда
		КартаВариант.ВариантЗубнойКарты = ПолучитьВариантКарты(Клиент);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КартаВариант.ЗубнаяКарта) Тогда
		КартаВариант.ЗубнаяКарта = ПолучитьЗубнуюКарту();		
	КонецЕсли;
	
	Возврат КартаВариант;
	
КонецФункции

Функция ПолучитьПараметрыЗубнойФормулыНаДату(Клиент, ЗубнаяКарта, Дата = Неопределено, Прием = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда 
		Дата = Дата(1,1,1);
	КонецЕсли;
	
	Если Прием = Неопределено Тогда 
		Прием = Документы.Прием.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	стомЗначенияПараметровЗубнойФормулыСрезПоследних.ЗубВКарте,
	|	стомЗначенияПараметровЗубнойФормулыСрезПоследних.СегментВЗубе,
	|	стомЗначенияПараметровЗубнойФормулыСрезПоследних.Параметр,
	|	стомЗначенияПараметровЗубнойФормулыСрезПоследних.Значение,
	|	1 КАК Приоритет,
	|	ЛОЖЬ КАК ИзмененоВТекущемПриеме
	|ПОМЕСТИТЬ ПараметрыЗубовПриемРегистр
	|ИЗ
	|	РегистрСведений.стомЗначенияПараметровЗубнойФормулы.СрезПоследних(
	|			&Дата,
	|			Клиент = &Клиент
	|				И ЗубнаяКарта = &ЗубнаяКарта) КАК стомЗначенияПараметровЗубнойФормулыСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемстомПараметрыЗубнойФормулы.ЗубВКарте,
	|	ПриемстомПараметрыЗубнойФормулы.СегментВЗубе,
	|	ПриемстомПараметрыЗубнойФормулы.Параметр,
	|	ПриемстомПараметрыЗубнойФормулы.Значение,
	|	0,
	|	ИСТИНА
	|ИЗ
	|	Документ.Прием.стомПараметрыЗубнойФормулы КАК ПриемстомПараметрыЗубнойФормулы
	|ГДЕ
	|	ПриемстомПараметрыЗубнойФормулы.Ссылка = &Прием
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыЗубовПриемРегистр.ЗубВКарте,
	|	ПараметрыЗубовПриемРегистр.СегментВЗубе,
	|	ПараметрыЗубовПриемРегистр.Параметр,
	|	ПараметрыЗубовПриемРегистр.Значение,
	|	ПараметрыЗубовПриемРегистр.ИзмененоВТекущемПриеме
	|ИЗ
	|	ПараметрыЗубовПриемРегистр КАК ПараметрыЗубовПриемРегистр
	|ГДЕ
	|	ПараметрыЗубовПриемРегистр.Приоритет В
	|			(ВЫБРАТЬ
	|				МИНИМУМ(МинПриоритет.Приоритет)
	|			ИЗ
	|				ПараметрыЗубовПриемРегистр КАК МинПриоритет
	|			ГДЕ
	|				МинПриоритет.ЗубВКарте = ПараметрыЗубовПриемРегистр.ЗубВКарте
	|				И МинПриоритет.СегментВЗубе = ПараметрыЗубовПриемРегистр.СегментВЗубе
	|				И МинПриоритет.Параметр = ПараметрыЗубовПриемРегистр.Параметр)";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ЗубнаяКарта", ЗубнаяКарта);
	Запрос.УстановитьПараметр("Прием", Прием);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СформироватьПараметрыЗубнойФормулыHTML(Клиент, ЗубнаяКарта, Прием, Знач ТаблицаПараметровЗФ = Неопределено) Экспорт 
	
	ОбозначенияЗубов = ПолучитьОбозначенияЗубовНаДату(Клиент, ЗубнаяКарта, Прием.Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыЗубнойФормулы.ЗубВКарте,
	|	ПараметрыЗубнойФормулы.СегментВЗубе,
	|	ПараметрыЗубнойФормулы.Параметр,
	|	ПараметрыЗубнойФормулы.Значение
	|ПОМЕСТИТЬ ПараметрыЗубнойФормулы
	|ИЗ
	|	&ПараметрыЗубнойФормулы КАК ПараметрыЗубнойФормулы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыЗубнойФормулы.ЗубВКарте КАК ЗубВКарте,
	|	ПараметрыЗубнойФормулы.СегментВЗубе КАК СегментВЗубе,
	|	ПараметрыЗубнойФормулы.Параметр,
	|	ПараметрыЗубнойФормулы.Значение
	|ИЗ
	|	ПараметрыЗубнойФормулы КАК ПараметрыЗубнойФормулы
	|ИТОГИ ПО
	|	ЗубВКарте,
	|	СегментВЗубе";
	Если ТаблицаПараметровЗФ = Неопределено Тогда 
		Запрос.УстановитьПараметр("ПараметрыЗубнойФормулы", Прием.стомПараметрыЗубнойФормулы.Выгрузить());
	Иначе
		Запрос.УстановитьПараметр("ПараметрыЗубнойФормулы", ТаблицаПараметровЗФ.Выгрузить(Новый Структура("ИзмененоВТекущемПриеме", Истина)));
	КонецЕсли;
	ВыборкаЗубы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаЗубы.Количество() = 0 Тогда 
		Возврат "";
	КонецЕсли;
	
	ДокументHTML = РаботаСDOMКлиентСервер.СоздатьДокументDOM("<TABLE style=""TABLE-LAYOUT: auto"" width=""100%"" border=1></TABLE>");
		
	Таблица = РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоИмени(ДокументHTML, "TABLE", Истина)[0];
	
	
	Пока ВыборкаЗубы.Следующий() Цикл
		
		ОбозначениеЗуба = ОбозначенияЗубов[ВыборкаЗубы.ЗубВКарте];
		
		СтрокаТаблицы = ДокументHTML.СоздатьЭлемент("TR");
		Таблица.ДобавитьДочерний(СтрокаТаблицы);
		
		КолонкаЗуб = ДокументHTML.СоздатьЭлемент("TD");
		СтрокаТаблицы.ДобавитьДочерний(КолонкаЗуб);
		
		СодержимоеКолонки = ДокументHTML.СоздатьЭлемент("DIV");
		АтрибутРазмещение = ДокументHTML.СоздатьАтрибут("align");
		АтрибутРазмещение.Значение = "center";
		СодержимоеКолонки.Атрибуты.УстановитьИменованныйЭлемент(АтрибутРазмещение);
		КолонкаЗуб.ДобавитьДочерний(СодержимоеКолонки);
		
		ЖирныйЭлемент = ДокументHTML.СоздатьЭлемент("B");
		СодержимоеКолонки.ДобавитьДочерний(ЖирныйЭлемент);
		
		ТекстЗуб = ДокументHTML.СоздатьТекстовыйУзел(ОбозначениеЗуба);
		ЖирныйЭлемент.ДобавитьДочерний(ТекстЗуб);
		
		КолонкаСегмент = ДокументHTML.СоздатьЭлемент("TD");
		СтрокаТаблицы.ДобавитьДочерний(КолонкаСегмент);
		
		// Содержимое колонки сегмента
		СодержимоеКолонки = ДокументHTML.СоздатьЭлемент("DIV");
		КолонкаСегмент.ДобавитьДочерний(СодержимоеКолонки);
		
		СписокСегменты = ДокументHTML.СоздатьЭлемент("UL");
		СодержимоеКолонки.ДобавитьДочерний(СписокСегменты);
		
		ВыборкаСегменты = ВыборкаЗубы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСегменты.Следующий() Цикл
			
			ЭлементСписка = ДокументHTML.СоздатьЭлемент("LI");
			СписокСегменты.ДобавитьДочерний(ЭлементСписка);
			
			ЖирныйЭлемент = ДокументHTML.СоздатьЭлемент("B");
			ЭлементСписка.ДобавитьДочерний(ЖирныйЭлемент);
			
			ТекстСегмент = ДокументHTML.СоздатьТекстовыйУзел(Строка(ВыборкаСегменты.СегментВЗубе) + ": ");
			ЖирныйЭлемент.ДобавитьДочерний(ТекстСегмент);
			
			ВыборкаПараметры = ВыборкаСегменты.Выбрать();
			Пока ВыборкаПараметры.Следующий() Цикл
				ТекстПараметр = ДокументHTML.СоздатьТекстовыйУзел(
					Строка(ВыборкаПараметры.Параметр) + ": " + Строка(ВыборкаПараметры.Значение) + "; ");
				ЭлементСписка.ДобавитьДочерний(ТекстПараметр);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Результат = РаботаСDOMКлиентСервер.ПолучитьТекстHTMLДокументаDOM(ДокументHTML);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДатуПоследнихИзмененийЗубнойКарты(ЗубнаяКарта, Клиент, ПриемСсылка) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДатыСостоянийВариантов.Период КАК Период,
	|	ДатыСостоянийВариантов.Документ
	|ИЗ
	|	(ВЫБРАТЬ
	|		стомСостоянияЗубовСрезПоследних.Период КАК Период,
	|		стомСостоянияЗубовСрезПоследних.Регистратор КАК Документ
	|	ИЗ
	|		РегистрСведений.стомСостоянияЗубов.СрезПоследних(
	|				,
	|				ЗубнаяКарта = &ЗубнаяКарта
	|					И Клиент = &Клиент) КАК стомСостоянияЗубовСрезПоследних
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		стомВариантыЗубовСрезПоследних.Период,
	|		стомВариантыЗубовСрезПоследних.Регистратор
	|	ИЗ
	|		РегистрСведений.стомВариантыЗубов.СрезПоследних(
	|				,
	|				ЗубнаяКарта = &ЗубнаяКарта
	|					И Клиент = &Клиент) КАК стомВариантыЗубовСрезПоследних) КАК ДатыСостоянийВариантов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	Запрос.УстановитьПараметр("ЗубнаяКарта", ЗубнаяКарта);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Новый Структура("Период, Документ", Выборка.Период, Выборка.Документ);
	Иначе  
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСписокДатДокументовДляИсторииЗубов(ЗубнаяКарта, Клиент) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	стомСостоянияЗубов.Период КАК Период
	|ИЗ
	|	РегистрСведений.стомСостоянияЗубов КАК стомСостоянияЗубов
	|ГДЕ
	|	стомСостоянияЗубов.Клиент = &Клиент
	|	И стомСостоянияЗубов.ЗубнаяКарта = &ЗубнаяКарта
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	стомВариантыЗубов.Период
	|ИЗ
	|	РегистрСведений.стомВариантыЗубов КАК стомВариантыЗубов
	|ГДЕ
	|	стомВариантыЗубов.Клиент = &Клиент
	|	И стомВариантыЗубов.ЗубнаяКарта = &ЗубнаяКарта
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	Запрос.УстановитьПараметр("ЗубнаяКарта", ЗубнаяКарта);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Период");
	
КонецФункции

#КонецОбласти
